[
{
    "date" : "April 8th, 11-12:30pm ET",
    "title": "A Conversation with Feminist Designers Social Club (FDSC)",
    "participants" : "Younghwa Kang / Ee-rang Park / In-ah Shin / Sun-ah Shin / moderated by Minkyoung Kim",
    "description" : "Founded in July 2018, Feminist Designers Social Club is a community of graphic designers dedicated to exposing the gender discriminatory structure of the field in South Korea and establishing new systems of design practice from feminist perspectives.</p><p>For Queer/Feminist/Praxis, four FDSC members, In-ah Shin, Younghwa Kang, Ee-rang Park, and Sun-ah Shin, discuss what it means to practice feminist design and cultivate communal support for each other’s praxis. The roundtable is moderated by Minkyoung Kim, Assistant Professor of Graphic Design at RISD.",
    "link" : "https://risd.zoom.us/webinar/register/WN_RfX_0WEbR-Gbkw8jTFUQuA"
},
{
    "date" : "April 9th, 4:15-5:45pm ET",
    "title": "Queer Desires, Trans Desires & Desirelessness",
    "participants" : "Eunjung Kim / So-Rim Lee / Jongwoo Jeremy Kim / Discussant: Samuel Perry",
    "description" : "Please join us for a panel session with Eunjung Kim (Syracuse University), So-Rim Lee (Columbia University), and Jongwoo Jeremy Kim (Carnegie Mellon University). The event is moderated by Samuel Perry (Brown University).</p><p>Eunjung Kim: “With Respect to Degeneration, Disability, and Desirelessness: The Conditions of Nonviolence in <i>The Vegetarian</i>”</p><p>So-Rim Lee: “Queer Performativity and the Economy of Shame: Plastic Surgery in <i>Let Me In</i>”</p><p>Jongwoo Jeremy Kim: “A K-Town Bathhouse Boy: Andrew Ahn’s <i>Spa Night</i> (2016)”" ,
    "link" : "https://risd.zoom.us/webinar/register/WN_dqjeaUEBT-iigHAwkDgqOQ"
},
{
    "date" : "April 13th, 6-7:30pm ET",
    "title": "Queer and Trans Activism in Korea and the Korean Diaspora",
    "participants" : "Sooyoung Kim / Ju Hui Judy Han / John Won / Discussant: Jiyeon Kang",
    "description" : "Please join us for a panel session with Sooyoung Kim (Emory University), Ju Hui Judy Han (UCLA), and John Won (KQTx National Network). The event is moderated by Jiyeon Kang (University of Iowa).</p><p>Sooyoung Kim: “A short note on the recent trans activism in South Korea”</p><p>Ju Hui Judy Han: “Performing family, seeking acceptance: a critique”</p><p>John Won, KQTx National Network: TBD",
    "link" : "https://risd.zoom.us/webinar/register/WN_s3uPy7XpR3yau4LrKv0dgw"
},
{
    "date" : "April 15th, 7-8:30pm ET",
    "title": "Artist’s Talk: KyungMook Kim",
    "participants" : "KyungMook Kim / with Una Chung",
    "description" : "The Korean filmmaker and artist KyungMook Kim discusses his films that portray the lives of marginalized beings in South Korea and his current works in progress with Una Chung, Associate Professor of Literature and Media at Sarah Lawrence College. Kim’s award-winning film, <i>Stateless Things</i> (2011), will be screened prior to his artist’s talk. Please register for the screening event <a href='https://www.eventbrite.com/e/qfp-film-screening-stateless-things-dir-kyungmook-kim-2011-tickets-142625694291' target='_blank'>here</a>.",
    "link" : "https://risd.zoom.us/webinar/register/WN_KS5o43qJSZqlu39CnjirvQ"
},
{
    "date" : "April 16th, 6-7:30pm ET",
    "title": "Live Performance & Artist’s Talk: Sungjae Lee",
    "participants" : "Sungjae Lee / with Avishek Ganguly",
    "description" : "The Seoul/Chicago-based artist Sungjae Lee performs live on Zoom, “My Own Private Iowa,” first performed in Chicago in 2018, based on his autobiographical experiences. For Q/F/P, Lee reconstructs his original installation, including a shrine for commemorating his family’s first encounter with the United States and for speculating his own racial, sexual, and religious identities. Following his live performance, Lee discusses his queer performative praxis with Avishek Ganguly, Associate Professor of Literary Arts and Studies at RISD.",
    "link" : "https://risd.zoom.us/webinar/register/WN_FiM4xMKBQ0emhy4H11yQcg"
},

{
    "date" : "April 20th, 6-7:30pm ET",
    "title": "Artist’s Talk: Kang Seung Lee",
    "participants" : "Kang Seung Lee / with Lisi Raskin",
    "description" : "The LA-based artist Kang Seung Lee has been forming and supporting intergenerational queer kinship through collaborative artmaking and queer archive building. Lee discusses his recent work in Korea and the US and the affect of intergenerational caring in queer communities with Lisi Raskin, Associate Professor of Sculpture at RISD.",
    "link" : "https://risd.zoom.us/meeting/register/tJwtc-6rqz0qEtGcadPxS-k6_u3x57YgVGnj"
},

{
    "date" : "April 22th, 7-8:30pm ET",
    "title": "Artist’s Talk: siren eun young jung",
    "participants" : "siren eun young jung / with Yeong Ran Kim",
    "description" : "The Seoul-based artist siren eun young jung has been ceaselessly pursuing artistic praxis that is simultaneously aesthetic and political. For Q/F/P, siren discusses her feminist-queer praxis across visual art, film, and performance, focusing on her decade-long, award-winning work <i>Yeosung Gukgeuk Project</i> with Yeong Ran Kim, a Mellon Digital Media Fellow at Sarah Lawrence College. <i>Deferral Theatre</i> (single channel video, 2018) will be screened prior to this event.",
    "link" : "https://risd.zoom.us/webinar/register/WN_Szo3vuZ1QZOvgwcTZMD45Q"
},
{
    "date" : "April 23th, 4:30-6pm ET",
    "title": "A Conversation with Hyperlink Press: Q/F/P for TransAsia",
    "participants" : "Hyperlink Press / moderated by Jung Joon Lee and Yeong Ran Kim",
    "description" : "Founded in 2018, Hyperlink Press is an online publication and curatorial collective to create intersectional platforms to showcase work by artists navigating the in-between spaces. For Q/F/P, the founding members of Hyperlink Press, Taehee Whang, Jeong Yoon Lee, and Minsoo Thigpen discuss their work inspired by South Korean online LGBTQ communities in the 2000s and share the time of utopic excitement for an equal world, breaking free from the traditional forms of community building. The roundtable is moderated by Jung Joon Lee, Associate Professor of Theory and History of Art and Design at RISD and Yeong Ran Kim, Mellon Digital Media Fellow at Sarah Lawrence College.",
    "link" : "https://risd.zoom.us/webinar/register/WN_Pwf07W_eRbqujNl20f_tWw"
}


]