[
{
    "date" : "April 8th, 11-12:30pm ET",
    "title": "A Conversation with Feminist Designers Social Club (FDSC)",
    "participants" : "Younghwa Kang / Ee-rang Park / In-ah Shin / Sun-ah Shin / moderated by Minkyoung Kim",
    "description" : "Please join us for a roundtable discussion between members of Feminist Designer Social Club (FDSC) and RISD students &amp; faculty. This event is moderated by Minkyoung Kim, Assistant Professor of Graphic Design at RISD.</p><p>In the world of graphic design world, 70% of the women are made up of women, but most of the main characters in the media and podium are men. In 2015, alogn with the so-called “feminist reboot” in Korea, the question, “Where did those many female designers disappear?” was raised to point out this imbalance, but for female designers, this only emphasizes the dark future and only promotes anxiety.</p><p>In this question, the Feminist Designer Social Club (FDSC) is a group that reveals the gender-discriminatory structure of feminist designers disappearing by changing 'where' to 'how', and creating a new order from a feminist perspective. It took its first step with 50 designers who gathered on the first Open Day in July 2018, and as of 2020, it has grown into a social club where 150 designers who are active in various fields and in various forms interact.",
    "link" : "https://risd.zoom.us/webinar/register/WN_RfX_0WEbR-Gbkw8jTFUQuA"
},
{
    "date" : "April 9th, 4:15-5:45pm ET",
    "title": "Queer Desires, Trans Desires & Desirelessness",
    "participants" : "Eunjung Kim / So-Rim Lee / Jongwoo Jeremy Kim / Discussant: Samuel Perry",
    "description" : "Please join us for a panel session with Eunjung Kim (Syracuse University), So-Rim Lee (Columbia University), and Jongwoo Jeremy Kim (Carnegie Mellon University). The event is moderated by Samuel Perry (Brown University).</p><p>Eunjung Kim is an associate professor of women’s and gender studies and disability studies at Syracuse University. She is the author of <i>Curative Violence: Rehabilitating Disability, Gender, and Sexuality in Modern Korea</i> (Duke University Press 2017) and has written on asexuality studies, transnational feminist disability studies, human/nonhuman boundaries, and minority politics in South Korea.</p><p>So-Rim investigates the intersections of embodiment, everyday performance, and visual culture in South Korea and the Korean diaspora. Her doctoral dissertation, <i>Performing the Self: Cosmetic Surgery and the Political Economy of Beauty in Korea</i>, explores how cosmetic surgery became a mode of performing the self and subjectivity in South Korea post-1997 Asian Financial Crisis. Using this work as a springboard, So-Rim is currently drafting her first book project that surveys the public discourse of “plastic surgery” (cosmetic and reconstructive surgeries) in South Korea's past 100 years.</p><p>Jongwoo Jeremy Kim is an Associate Professor of Critical Studies in Art History and Theory at Carnegie Mellon University's School of Art. His publications include <i>Painted Men in Britain, 1868-1918</i>, <i>Queer Difficulty in Art and Poetry</i>, and the article “Filming the Queerness of Comfort Women: Byun Young–Joo’s The Murmuring, 1995.” Dr. Kim was born in Busan, South Korea, and immigrated to the United States in the 1990s.",
    "link" : "https://risd.zoom.us/webinar/register/WN_dqjeaUEBT-iigHAwkDgqOQ"
},
{
    "date" : "April 13th, 6-7:30pm ET",
    "title": "Queer and Trans Activism in Korea and the Korean Diaspora",
    "participants" : "Sooyoung Kim / Ju Hui Judy Han / John Won / Discussant: Jiyeon Kang",
    "description" : "Please join us for a panel session with Sooyoung Kim (Emory University), Ju Hui Judy Han (UCLA), and John Won (KQTx National Network). The event is moderated by Jiyeon Kang (University of Iowa).</p><p>Sooyoung is a first-year PhD Student in Women’s, Gender and Sexuality studies at Emory University, holding her master’s in Culture and Gender Studies from Yonsei University, South Korea. Her research interests include transgender studies, trans activism, trans of color critique, and ethnography. Her current research explores the shifting relationship of trans bodies, labor and capital in South Korea.</p><p>Ju Hui Judy Han is a queer Korean/American cultural geographer and activist based in Los Angeles. Her research and publications concern conservative religious formations, political activism, and protest cultures. She teaches courses on gender and sexuality, power and (im)mobilities, and comics in the Gender Studies department at UCLA, and is part of the Korean Studies Distinguished Speakers Bureau for the Association for Asian Studies.</p><p>John is a queer 2nd-generation Korean American cis man who lives in Berkeley, California. For nearly 30 years, John has been an activist, advocate, facilitator, and leader in communities and movements addressing LGBTQ rights, racial justice, immigrant organizing, and HIV/AIDS/community health. He was a member of early Korean LGBTQ groups in New York in the 1990s and 2000s including Chingusai and Iban/Queer Koreans of New York. In 2004, he co-founded the Dari Project which published the first bilingual stories by Korean LGBTs and their families. He serves in leadership of KQTx National Network which began with the 2018 KQTcon national conference in New York City.",
    "link" : "https://risd.zoom.us/webinar/register/WN_s3uPy7XpR3yau4LrKv0dgw"
},
{
    "date" : "April 15th, 7-8:30pm ET",
    "title": "Artist’s Talk: KyungMook Kim",
    "participants" : "KyungMook Kim / with Una Chung",
    "description" : "Please join us for an artist's talk with the artist/filmmaker KyungMook Kim. This event is moderated by Una Chung (Sarah Lawrence College). KyungMook's award-winning film, <i>Stateless Things</i> (2012), will be screened in advance of his talk. Please see details under Exhibitions &amp; Screenings.</p><p>KyungMook Kim is a filmmaker based in Seoul. Ranging from video art, documentary and narrative film to expended form of cinema, his works explore the precarity of the marginalized such as homosexuals, transsexuals, sex workers, and North Korean defectors.",
    "link" : "https://risd.zoom.us/webinar/register/WN_KS5o43qJSZqlu39CnjirvQ"
},
{
    "date" : "April 16th, 6-7:30pm ET",
    "title": "Live Performance & Artist’s Talk: Sungjae Lee",
    "participants" : "Sungjae Lee / with Avishek Ganguly",
    "description" : "Please join us for Sungjae Lee's live performance, followed by his artist's talk. This event is moderated by Avishek Ganguly (RISD).</p><p>SUNGJAE LEE is a Seoul-born, Chicago-based artist. He makes performance, installation, text, and video focusing on queer Asians and their desires that have been regarded as effeminate, desexualized, and thus invisible in the West. He has presented his works globally in Korea, Sweden, Canada, New Zealand, and the US. He received his B.F.A. in Sculpture from Seoul National University and M.F.A. in Performance Art from The School of the Art Institute of Chicago.",
    "link" : "https://risd.zoom.us/webinar/register/WN_FiM4xMKBQ0emhy4H11yQcg"
},

{
    "date" : "April 20th, 6-7:30pm ET",
    "title": "Artist’s Talk: Kang Seung Lee",
    "participants" : "Kang Seung Lee / with Lisi Raskin",
    "description" : "Please join us for an artist's talk with Kang Seung Lee. This event is moderated by Lisi Raskin (RISD).</p><p>Kang Seung Lee is a multidisciplinary artist who was born in South Korea and now lives and works in Los Angeles. His work frequently engages the legacy of transnational queer histories, particularly as they intersect with art history. Forthcoming solo exhibitions will be held at Commonwealth and Council, Los Angeles and Gallery Hyundai, Seoul (2021). Lee will participate in the 13th Gwangju Biennale and be included in group exhibitions at MASS MoCA, North Adams, MA, and Leslie-Lohman Museum, New York, NY, in 2021.",
    "link" : "https://risd.zoom.us/meeting/register/tJwtc-6rqz0qEtGcadPxS-k6_u3x57YgVGnj"
},

{
    "date" : "April 22th, 7-8:30pm ET",
    "title": "Artist’s Talk: siren eun young jung",
    "participants" : "siren eun young jung / with Yeong Ran Kim",
    "description" : "Please join us for an artist's talk with siren eun young jung. This event is moderated by Yeong Ran Kim (Sarah Lawrence College).</p><p>Born in 1974 in Incheon, South Korea, siren eun young jeung currently lives and works in Seoul. She studied the visual arts and feminist theory at Ewha Womans [sic] University (BFA, MFA, and DFA) in South Korea and the University of Leeds (MA). She is interested in how the seething desires of anonymous individuals encounter events in the world and become resistance, history, and politics. She believes that, by ceaselessly reexamining feminist-queer methodology, artistic praxis that is simultaneously aesthetic and political is possible. Her representative works include the “Dongducheon Project” (2007-2009) and the “Yeoseong Gukgeuk Project” (2008-present), and she works across genres including art, film, and performance. She has grown mainly through major exhibitions in Asia such as “Tradition (Un)Realized” (2014), “Ghosts, Spies, Grandmothers: SeMA Biennale Mediacity Seoul” (2014), “Discordant Harmony” (2015, 2016), Asia Pacific Triennial of Contemporary Art (2015-16), Gwangju Biennale (2016), Taipei Biennial (2017), Shanghai Biennale (2018), Tokyo Performing Arts Market (TPAM)—Performing Arts Meeting in Yokohama (2014, 2018), Serendipity Art Festival (2018) and Kyoto Experiments(2019). She has received the 2013 Hermes Foundation Art Award, 2015 Sindoh Art Prize, and 2018 Korea Artist Prize and participated in the exhibition in the Korean Pavilion at the 2019 Venice Biennale.",
    "link" : "https://risd.zoom.us/webinar/register/WN_Szo3vuZ1QZOvgwcTZMD45Q"
},
{
    "date" : "April 23th, 4:30-6pm ET",
    "title": "A Conversation with Hyeprlink Press: Q/F/P for TransAsia",
    "participants" : "Hyperlink Press / moderated by Jung Joon Lee and Yeong Ran Kim",
    "description" : "Please join us for a roundtable discussion with the artist collective Hyperlink Press. This event is moderated by Jung Joon Lee (RISD) and Yeong Ran Kim (Sarah Lawrence College).</p><p>Inspired by South Korean online LGBTQ communities in the 2000s, Hyperlink Press is an online publication and curatorial collective to create intersectional platforms to showcase work by artists navigating the in-between spaces. Hyperlink Press’ mission is to empower the underrepresented history, experience, and identity in the tech field, and art gallery system. Founded by Taehee Whang, Jeong Yoon Lee, and Minsoo Thigpen in 2018, Hyperlink Press would like to share the time of utopic excitement, that we felt back in our shared childhood of 2000s, for an equal world, breaking free from the traditional forms of community building.",
    "link" : "https://risd.zoom.us/webinar/register/WN_Pwf07W_eRbqujNl20f_tWw"
}


]